In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
pd.set_option('display.float_format', '{:.6f}'.format)
import json

### Explorando la data

In [2]:
df = pd.read_csv('movies_metadata.csv')
df.head(5)

d:\python\lib\site-packages\IPython\core\interactiveshell.py:3155: DtypeWarning: Columns (10) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.000000,81.000000,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.700000,5415.000000
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.000000,104.000000,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.900000,2413.000000
2,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,...,1995-12-22,0.000000,101.000000,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False,6.500000,92.000000
3,False,NaN,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",...,1995-12-22,81452156.000000,127.000000,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Friends are the people who let you be yourself...,Waiting to Exhale,False,6.100000,34.000000
4,False,"{'id': 96871, 'name': 'Father of the Bride Col...",0,"[{'id': 35, 'name': 'Comedy'}]",NaN,11862,tt0113041,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,...,1995-02-10,76578911.000000,106.000000,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Just When His World Is Back To Normal... He's ...,Father of the Bride Part II,False,5.700000,173.000000

- Aquí me puedo dar cuenta que es un dataset que contiene jsons como valores en columnas, entonces tengo que proceder a hacer una limpieza de los jsons para obtener los valores que necesito.

In [3]:
df['genres'][0]

"[{'id': 16, 'name': 'Animation'}, {'id': 35, 'name': 'Comedy'}, {'id': 10751, 'name': 'Family'}]"

In [4]:
df['genres'] = df['genres'].str.replace("\'","\"")
df['genres'][0]

'[{"id": 16, "name": "Animation"}, {"id": 35, "name": "Comedy"}, {"id": 10751, "name": "Family"}]'

### Vamos a separar los json de las columnas

In [5]:
json_cols = ['genres']
def clean(x):
    '''
    json.loads() method can be used to parse a valid JSON string and
    convert it into a Python Dictionary. It is mainly used for 
    deserializing native string, byte, 
    or byte array which consists of JSON data into Python Dictionary.
    '''
    return json.loads(x)

for x in json_cols:
    df[x] = df[x].apply(clean)

In [7]:
def new_json2(x):

    ls = []

    for y in range(len(x[0])):

        for k, v in x[0][y].items():
            ls.append(str(k)+ "_" +str(v))
   
    for z in range(len(ls)):

        if ls[z] not in df.columns:
            df[ls[z]] = 0
            df[ls[z]].iloc[x.name] = 1
        else:
            df[ls[z]].iloc[x.name] = 1
    return

for x in json_cols:
    df[[x]].apply(new_json2, axis=1)

In [8]:
df.columns

Index(['adult', 'belongs_to_collection', 'budget', 'genres', 'homepage', 'id',
       'imdb_id', 'original_language', 'original_title', 'overview',
       'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'video',
       'vote_average', 'vote_count', 'id_16', 'name_Animation', 'id_35',
       'name_Comedy', 'id_10751', 'name_Family', 'id_12', 'name_Adventure',
       'id_14', 'name_Fantasy', 'id_10749', 'name_Romance', 'id_18',
       'name_Drama', 'id_28', 'name_Action', 'id_80', 'name_Crime', 'id_53',
       'name_Thriller', 'id_27', 'name_Horror', 'id_36', 'name_History',
       'id_878', 'name_Science Fiction', 'id_9648', 'name_Mystery', 'id_10752',
       'name_War', 'id_10769', 'name_Foreign', 'id_10402', 'name_Music',
       'id_99', 'name_Documentary', 'id_37', 'name_Western', 'id_10770',
       'name_TV Movie', 'name_Carousel Productions', 'id_11176',
       'name_Vision View Entertainment', 'id_11602',
       'name_Telescene Film Group Productions', 'id_29812', 'name_Aniplex',
       'id_2883', 'name_GoHands', 'id_7759', 'name_BROSTA TV', 'id_7760',
       'name_Mardock Scramble Production Committee', 'id_7761',
       'name_Sentai Filmworks', 'id_33751', 'name_Odyssey Media', 'id_17161',
       'name_Pulser Productions', 'id_18012', 'name_Rogue State', 'id_18013',
       'name_The Cartel', 'id_23822'],
      dtype='object')

### Ahora vamos a mezclar los datasets 
* esto con el objetivo de poder tener nuestra data unificada

In [10]:
df2= pd.read_csv('links_small.csv')
df2.tail(5)

      movieId   imdbId        tmdbId
9120   162672  3859980 402672.000000
9121   163056  4262980 315011.000000
9122   163949  2531318 391698.000000
9123   164977    27660 137608.000000
9124   164979  3447228 410803.000000

In [21]:
df['id']

0           862
1          8844
2         15602
3         31357
4         11862
          ...
45461    439050
45462    111109
45463     67758
45464    227506
45465    461257
Name: id, Length: 45466, dtype: object

In [14]:
df2.dtypes

movieId      int64
imdbId       int64
tmdbId     float64
dtype: object

* Tenemos que convertir las variables al mismo tipo, en este caso voy a pasar la variable del df2 *tmbId* a objeto como es la variable *id* del df

In [18]:
df2['tmdbId']=df2['tmdbId'].astype(str).str.replace("\.0","")
df2['tmdbId'] = df2['tmdbId'].astype(object)

<ipython-input-18-bb41eae91ee8>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df2['tmdbId']=df2['tmdbId'].astype(str).str.replace("\.0","")

In [19]:
df3 = pd.merge(df,df2,left_on='id',right_on='tmdbId')

In [23]:
df_ratings = pd.read_csv('ratings_small.csv')
df_ratings.head(5)

   userId  movieId   rating   timestamp
0       1       31 2.500000  1260759144
1       1     1029 3.000000  1260759179
2       1     1061 3.000000  1260759182
3       1     1129 2.000000  1260759185
4       1     1172 4.000000  1260759205

In [ ]:
#No estoy seguro si debería de eliminar la columna timestamp
#filtered_ratings = df_ratings.drop('timestamp',axis=1)

In [24]:
df_final = pd.merge(df3,df_ratings, on = 'movieId')

In [26]:
df_final.isna

<bound method DataFrame.isna of        adult                              belongs_to_collection    budget  \
0      False  {'id': 10194, 'name': 'Toy Story Collection', ...  30000000
1      False  {'id': 10194, 'name': 'Toy Story Collection', ...  30000000
2      False  {'id': 10194, 'name': 'Toy Story Collection', ...  30000000
3      False  {'id': 10194, 'name': 'Toy Story Collection', ...  30000000
4      False  {'id': 10194, 'name': 'Toy Story Collection', ...  30000000
...      ...                                                ...       ...
99845  False  {'id': 286023, 'name': 'Sharknado Collection',...         0
99846  False                                                NaN   8000000
99847  False                                                NaN   1000000
99848  False                                                NaN  15050000
99849  False                                                NaN         0

                                                  genres  \
0      [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
1      [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
2      [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
3      [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
4      [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
...                                                  ...
99845  [{'id': 35, 'name': 'Comedy'}, {'id': 27, 'nam...
99846                      [{'id': 18, 'name': 'Drama'}]
99847  [{'id': 53, 'name': 'Thriller'}, {'id': 10749,...
99848  [{'id': 12, 'name': 'Adventure'}, {'id': 18, '...
99849  [{'id': 99, 'name': 'Documentary'}, {'id': 104...

                                    homepage      id    imdb_id  \
0       http://toystory.disney.com/toy-story     862  tt0114709
1       http://toystory.disney.com/toy-story     862  tt0114709
2       http://toystory.disney.com/toy-story     862  tt0114709
3       http://toystory.disney.com/toy-story     862  tt0114709
4       http://toystory.disney.com/toy-story     862  tt0114709
...                                      ...     ...        ...
99845         http://www.syfy.com/sharknado4  390989  tt4831420
99846                                    NaN  159550  tt0255313
99847                                    NaN  392572  tt5165344
99848                                    NaN  402672  tt3859980
99849  http://www.thebeatlesliveproject.com/  391698  tt2531318

      original_language                                     original_title  \
0                    en                                          Toy Story
1                    en                                          Toy Story
2                    en                                          Toy Story
3                    en                                          Toy Story
4                    en                                          Toy Story
...                 ...                                                ...
99845                en                       Sharknado 4: The 4th Awakens
99846                en                     The Last Brickmaker in America
99847                hi                                             रुस्तम
99848                hi                                       Mohenjo Daro
99849                en  The Beatles: Eight Days a Week - The Touring Y...

                                                overview  ...  \
0      Led by Woody, Andy's toys live happily in his ...  ...
1      Led by Woody, Andy's toys live happily in his ...  ...
2      Led by Woody, Andy's toys live happily in his ...  ...
3      Led by Woody, Andy's toys live happily in his ...  ...
4      Led by Woody, Andy's toys live happily in his ...  ...
...                                                  ...  ...
99845  The new installment of the Sharknado franchise...  ...
99846  A man must cope with the loss of his wife and ...  ...
99847  Rustom Pavri, an honourable officer of the Ind...  ...
99848  Village lad Sarman is drawn to big, bad Mohenj...  ...
99849  The band stormed Europe in 1963, and, in 1964,...  ...

      name_Rogue State id_18013 name_The Cartel id_23822 movieId   imdbId  \
0                    0        0               0        0       1   114709
1                    0        0               0        0       1   114709
2                    0        0               0        0       1   114709
3                    0        0               0        0       1   114709
4                    0        0               0        0       1   114709
...                ...      ...             ...      ...     ...      ...
99845                0        0               0        0  161918  4831420
99846                0        0               0        0  161944   255313
99847                0        0               0        0  162542  5165344
99848                0        0               0        0  162672  3859980
99849                0        0               0        0  163949  2531318

       tmdbId userId   rating   timestamp
0         862      7 3.000000   851866703
1         862      9 4.000000   938629179
2         862     13 5.000000  1331380058
3         862     15 2.000000   997938310
4         862     19 3.000000   855190091
...       ...    ...      ...         ...
99845  390989    624 1.500000  1472929873
99846  159550    287 5.000000  1470167824
99847  392572    611 5.000000  1471520667
99848  402672    611 3.000000  1471523986
99849  391698    547 5.000000  1476419239

[99850 rows x 94 columns]>

In [27]:
df_final = df_final.fillna(0)

In [33]:
df_final.head(5)

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,name_Rogue State,id_18013,name_The Cartel,id_23822,movieId,imdbId,tmdbId,userId,rating,timestamp
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,0,0,0,0,1,114709,862,7,3.000000,851866703
1,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,0,0,0,0,1,114709,862,9,4.000000,938629179
2,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,0,0,0,0,1,114709,862,13,5.000000,1331380058
3,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,0,0,0,0,1,114709,862,15,2.000000,997938310
4,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,0,0,0,0,1,114709,862,19,3.000000,855190091

In [35]:
df_final.shape

(99850, 94)

### Funciones para el sistema de recomendación

In [29]:
def cost(Y, X, T):
    return(((X @ T.T - Y) ** 2) * ((Y != 0) * 1)).sum()


def gradient(Y, X, T):
    R = (Y != 0) * 1
    hip_error = (X @ T.T - Y) * R

    return (
        hip_error @ T,
        hip_error.T @ X,
    )


def adam(
        Y,
        Xo,
        To,
        fun,
        jac,
        alpha=0.001,
        beta1=0.9,
        beta2=0.999,
        epsilon=0.0000001,
        max_iter=1000
):
    xm = np.zeros(Xo.shape)
    tm = np.zeros(To.shape)

    xv = np.zeros(Xo.shape)
    tv = np.zeros(To.shape)

    X, T, t = Xo, To, 0

    while t < max_iter:
        t += 1

        xg, tg = jac(Y, X, T)

        #print(f'{t} \t loss={fun(Y, X, T).item():,.2f}')

        xm = beta1 * xm + (1 - beta1) * xg
        tm = beta1 * tm + (1 - beta1) * tg

        xv = beta2 * xv + (1 - beta2) * xg * xg
        tv = beta2 * tv + (1 - beta2) * tg * tg

        xmh = xm / (1 - beta1 ** t)
        tmh = tm / (1 - beta1 ** t)

        xvh = xv / (1 - beta2 ** t)
        tvh = tv / (1 - beta2 ** t)

        X -= alpha * xmh / (np.sqrt(xvh) + epsilon)
        T -= alpha * tmh / (np.sqrt(tvh) + epsilon)

    return X, T